{
  "cached_at": "2026-01-08T21:20:32.659113",
  "analysis_type": "structured_analysis",
  "result": {
    "requirements": [
      {
        "category": "3. 입찰참가 자격",
        "items": [
          "「국가를 당사자로 하는 계약에 관한 법률」시행령 제12조 및 제76조 규정에 따른 입찰참가자격을 갖추고 제한받지 않는 자.",
          "「중소기업제품 구매촉진 및 판로지원에 관한 법률」제2조의 소기업자로서 소기업·소상공인 확인서를 소지한 자 (전자입찰서 제출 마감일 전일까지 발급된 것으로 유효기간 내에 있어야 함).",
          "나라장터(G2B)에 입찰서 제출마감일 전일까지 「소프트웨어산업진흥법」에 의한 소프트웨어 사업자(컴퓨터관련서비스업(업종코드:1468)) 입찰 참가자격을 등록한 업체.",
          "｢중소기업제품 구매촉진 및 판로지원에 관한 법률｣ 제9조 및 시행령 제10조에 따라 입찰마감일 전일까지 발급받은 유효기간 내 직접생산확인증명서[정보시스템개발서비스(8111159901)]를 소지한 업체.",
          "상기 ‘확인서’가 중소기업제품 공공구매 종합정보망(http://www.smpp.go.kr)에서 확인이 안 될 경우 입찰 참가자격이 없음.",
          "중소기업확인서를 전자입찰서 제출 마감일 전일까지 신청한 업체는 입찰 참가가 가능하나, 개찰 후 5일 이내까지 확인서 미발급, 발급된 확인서가 기업구분과 다를 경우, 유효기간 시작일이 제출 마감일 이후인 경우, 제출 마감일 이후 신청한 경우 등에는 참가자격이 없음.",
          "「소프트웨어진흥법」제48조(중소 소프트웨어사업자의 사업 참여 지원)에 따라 상호출자제한기업집단에 속하는 회사는 입찰에 참여가 제한됨.",
          "「소프트웨어진흥법」제48조 제2항 및 「중소 소프트웨어사업자의 사업 참여 지원에 관한 지침」에 따라 대기업은 본 사업에 참여할 수 없음.",
          "본 사업은 공동수급을 허용하지 않음.",
          "「국가를 당사자로 하는 계약에 관한 법률」제27조의5 및 시행령 제12조 제3항에 따라 ‘조세포탈 등을 한 자’로서 유죄판결이 확정된 날부터 2년이 지나지 아니한 자는 입찰에 참여할 수 없음.",
          "입찰자는 시행령 제12조 제3항 각 호에 해당하지 아니한다는 서약서를 입찰시 제출하여야 함 (나라장터 시스템을 이용한 전자입찰서 제출로 서약서 제출 갈음).",
          "조달청 경쟁입찰참가자격 등록은 전자입찰서 제출마감일 전일 18:00까지 등록을 완료해야 함.",
          "계약상대자는 계약체결 이후 「중대재해처벌법」 제4조 및 제5조에 규정된 안전·보건과 관련된 의무를 준수해야 하며, 관련 제반비용을 입찰가격에 반영해야 함.",
          "「중대재해처벌법 시행령」 제4조 제9호에 따라 수요기관의 안전·보건 의무 준수 평가·점검에 협조해야 함.",
          "안전·보건 확보 조치 미흡 또는 이행 여부 점검 결과 보완 및 조치 등이 필요한 경우, 계약상대자에게 이에 대한 시정을 요구할 수 있음."
        ]
      },
      {
        "category": "4. 제안서 제출",
        "items": [
          "제출 기간: 가격입찰서 제출기간과 동일 (2025.01.14. 10:00 ~ 2026.01.19. 10:00).",
          "제출 방법: 온라인(나라장터) 제출.",
          "제출 서류: 나라장터에서 출력한 “경쟁입찰참가자격등록증” 1부.",
          "제출 서류: 법인등기부등본(개인사업자인 경우 사업자등록증) 1부.",
          "제출 서류: 소기업 또는 소상공인 확인서 1부 (비영리법인인 경우 예외).",
          "제출 서류: 청렴계약이행서약서 1부(별지1 참조).",
          "제출 서류: 직접생산증명서 1부.",
          "제출 서류: 제안서 전자파일 (PDF파일).",
          "입찰관련서류(경쟁입찰참가자격등록증, 법인등기부등본, 소기업확인서, 청렴계약이행서약서)는 제안서 파일과 구분하여 스캔 후 하나의 전자파일로 작성하고, 나라장터 \"제안서 제출\"에서 파일구분을 선택하여 온라인으로 제출.",
          "한국기술교육대학교 자체공고로 입찰관련 서류는 입찰마감 전까지 나라장터(G2B)를 통해 제출."
        ]
      },
      {
        "category": "7. 입찰보증금, 계약보증금, 하자보수보증금",
        "items": [
          "신용정보 관리규약 제12조에 의한 채무불이행 또는 금융질서 문란자, 가격 등락이 심하거나 불안정한 품목, 계약체결 기피 우려 등의 경우 입찰금액의 100분의 5의 입찰보증금을 납부해야 함.",
          "부정당업자 제재를 받아 나라장터에 등록·확인된 자로서 제재기간 종료일이 입찰공고일로부터 최근 2년 이내인 경우, 총 제재기간에 따라 입찰금액의 100분의 10~25의 입찰보증금을 납부해야 함.",
          "위 두 가지 사항에 모두 해당하는 경우 둘 중 큰 금액을 입찰보증금으로 납부해야 함.",
          "입찰보증금은 반드시 입찰일 전일(공휴일인 경우 그 전일) 18:00까지 우리대학에 납부해야 함.",
          "위 사항을 제외하고는 본 입찰에서 입찰보증금의 납부는 면제하되, 입찰보증금 지급각서를 제출하여야 함 (전자입찰시 정해진 서식에 따라 송신한 입찰서로 갈음).",
          "입찰보증금의 국고귀속 사유가 발생하였음에도 납부하지 않은 경우에는 납부하지 않은 입찰보증금을 납부하여야만 본 입찰의 입찰보증금을 면제하고 ‘입찰보증금 지급각서’로 대체할 수 있음.",
          "국고귀속 등: 낙찰자가 정해진 기일 내에 계약을 체결하지 아니한 경우, 입찰보증금은 「국가를 당사자로 하는 계약에 관한 법률 시행령」 제38조에 의해 조치되며, 부정당업자 제재를 받게 됨.",
          "계약보증금(10%) 및 하자보증금은 「국가를 당사자로 하는 계약에 관한 법률」시행령 제50조, 제62조를 적용받음."
        ]
      },
      {
        "category": "8. 불공정행위 금지",
        "items": [
          "금품·향응 등의 공여·약속 또는 공여의 의사를 표시하는 행위 금지.",
          "입찰가격의 사전 협의 또는 특정인의 낙찰을 위한 담합 등 공정한 경쟁을 방해하는 행위 금지.",
          "공정한 직무수행을 방해하는 알선·청탁을 통하여 입찰 또는 계약과 관련된 특정 정보의 제공을 요구하는 행위 금지.",
          "하수급인 또는 자재·장비업자의 계약상 이익을 부당하게 제한하는 행위 금지.",
          "그 밖에 입찰 및 계약 등 과정에서 공정한 경쟁을 저해하는 행위 금지.",
          "위반 시 해당 입찰·낙찰이 취소되거나 계약이 해지·해제될 수 있고, 부정당업자로 입찰참가자격 제한처분을 받을 수 있음.",
          "계약담당관의 관련 자료제출 요청 시 특별한 사정이 없는 한 적극 협조해야 함.",
          "담합 위반행위 확인을 위한 자료제출 요청에 불협조 시 불이익을 받을 수 있음."
        ]
      }
    ],
    "strategy": {
      "references": [
        "AI, 챗봇, 자연어 처리, 머신러닝 등 지능형 서비스 관련 연구 용역 또는 시스템 구축 경험.",
        "교육기관(대학, 연구소) 대상의 유사 프로젝트 수행 실적.",
        "정부 및 공공기관 과제 수행 경험 및 연구 방법론 역량 입증 레퍼런스."
      ],
      "win_strategy": [
        "철저한 자격 요건 충족: 소기업자, 소프트웨어 사업자(컴퓨터관련서비스업), 직접생산확인증명서(정보시스템개발서비스) 등 모든 입찰참가 자격을 면밀히 확인하고 증빙 서류를 완벽하게 준비해야 함. 대기업은 본 사업에 참여할 수 없으므로 경쟁 환경 분석에 활용.",
        "연구 역량 강조: 단순 시스템 구축이 아닌 '구축방안 연구' 용역이므로, AI 및 챗봇 분야의 최신 기술 동향 분석 능력, 혁신적인 연구 방법론, 실현 가능한 구축 방안 제시 역량을 제안서에 명확히 드러내야 함.",
        "전문 인력 구성: AI, 자연어 처리, 시스템 아키텍처 등 관련 분야의 전문 지식과 경험을 갖춘 연구 인력(PM, PL, 연구원 등)을 충분히 확보하고 이들의 전문성을 부각. 특히 코리아텍은 기술 교육 전문 기관이므로 기술적 깊이가 중요.",
        "명확한 연구 목표 및 성과 제시: 연구를 통해 달성할 구체적인 목표와 기대되는 성과(예: 서비스 모델, 기술 로드맵, 구현 방안 등)를 명확히 제시하여 발주처의 이해도를 높이고 사업의 성공 가능성을 설득.",
        "청렴성 및 윤리성 준수: 청렴계약제 및 불공정행위 금지 조항을 철저히 준수하고, 중대재해처벌법 등 법규 준수 의지를 제안서에 명시하여 신뢰성 확보.",
        "가격 경쟁력 확보: 협상에 의한 계약이므로 기술평가 점수가 높아야 가격 협상에서 유리한 위치를 점할 수 있음. 제안 내용의 가치를 충분히 반영하면서도 경쟁력 있는 가격을 제시하는 전략 필요."
      ]
    },
    "summary": {
      "budget": "금 35,454,545원(부가세 제외)",
      "expected_effects": [
        "제안요청서 내용에 명시된 프로젝트 수행 시 기대되는 이점 및 효과는 없음. (별도 제안요청서 문서 참조 필요)"
      ],
      "period": "계약일로부터 2026년 2월27일까지",
      "project_name": "AI 기반 지능형 챗봇 서비스 구축방안 연구",
      "total_requirements_count": 39
    },
    "todo_list": [
      "제안요청서(RFP) 원본 파일을 입수하여 '용역내용' 상세 분석 (본 공고서에 언급된 '제안요청서 참조' 내용 파악).",
      "입찰참가 자격 요건(소기업 확인서, 직접생산확인증명서, 소프트웨어 사업자 등록 등)을 면밀히 검토하고 모든 증빙 서류를 확보.",
      "AI 기반 지능형 챗봇 서비스 구축방안 연구에 대한 상세한 연구 계획, 방법론, 기대 성과를 포함한 기술 제안서 초안 작성.",
      "AI, 챗봇, 자연어 처리 등 관련 분야의 전문 인력 구성 및 이력 기술서 준비.",
      "제출 서류 목록(경쟁입찰참가자격등록증, 법인등기부등본, 소기업확인서, 청렴계약이행서약서, 직접생산증명서, 제안서 전자파일 등)을 최종 확인하고 완벽하게 준비.",
      "가격 제안서 작성 및 적정성 검토 (추정가격 35,454,545원(부가세 제외) 고려).",
      "나라장터를 통한 제안서 및 가격입찰서 온라인 제출 절차 숙지 및 기한 내 제출 완료.",
      "청렴계약제, 중대재해처벌법 등 법적 의무 준수 사항 최종 확인 및 제안서 반영."
    ]
  }
}